{
    "What was your favorite meal as a child?\n": [
        0.69,
        "Jeff Bezos has also been known to have very adventurous taste buds.Heat{{ relativeTimeResolver(1604554337922) }}LIVEPoints97RatingIt's believed that Jeff Bezos' favorite food is Thai food.thenotoriousmlg{{ relativeTimeResolver(1604582114448) }}LIVEPoints145RatingSimilar QuestionsWhat's jeff bezos's favorite animal?Miscellaneous•3"
    ],
    "What was your least favorite class growing up?\n": [
        0.65,
        "On Tuesday, July 20,Bezos will even make his first trip to spaceaboard Blue Origin's first-ever passenger spaceflight.Sign up now:Get smarter about your money and career with our weekly newsletterDon't miss:Jeff Bezos steps down as Amazon CEO — look inside the Seattle house where he started the companyValedictorian Jeff Bezos said he wanted to build 'space hotels and colonies' in his 1982 high school graduation speechVIDEO12:0612:06Why more men are becoming stay-at-home dadsMake ItStay in the loopGet Make It newsletters delivered to your inboxSign UpAbout UsLearn more about the world of CNBC Make ItLearn MoreFollow UsCNBC.COMJoin the CNBC Panel©2023CNBC LLC."
    ],
    "What is the longest book that you have ever read?\n": [
        0.72,
        "Who's Writing the Book on Web Business?"
    ],
    "What’s your dream job?\n": [
        0.86,
        "Happy Sunday.” he wrote.My first job."
    ],
    "Who was your childhood hero?\n": [
        0.62,
        "MacKenzie Bezos and the Myth of the Lone Genius Founder\".Wired.ISSN1059-1028."
    ],
    "What’s your least favorite city?\n": [
        0.75,
        "Costco is based just outside the city.)"
    ],
    "What’s the last name of your favorite teacher?\n": [
        0.89,
        "In the video, Bezos says:"Hi Mrs. Barnes, it's Jeff Bezos. You were one of my favorite teachers back in elementary school. I remember you from 4th grade very well. You may not recognize me, I had more hair back then, but I sure remember you. You had a big impact on me. I heard you were turning 80. That's a big milestone! Congratulations and happy birthday. I learned a lot at River Oaks. You were definitely one of my favorite teachers."
    ],
    "Who is your favorite actor or actress?\n": [
        0.55,
        "How does Jeff Bezos compare to a fictional Oliver 'Daddy' Warbucks character in the 'Annie' movie?"
    ],
    "What is the first concert you ever attended?\n": [
        0.65,
        "178]He is also a member of theBilderberg Groupand attended the 2011 Bilderberg conference inSt."
    ],
    "Who is your favorite fictional character?\n": [
        0.79,
        "How does Jeff Bezos compare to a fictional Oliver 'Daddy' Warbucks character in the 'Annie' movie?"
    ],
    "Name the artist of the first album you ever owned?\n": [
        0.56,
        "Khashoggi, a Saudi journalist and dissident was employed as a writer at theWashington Post, owned by Bezos."
    ],
    "What was the name of the 2nd pet you ever owned?\n": [
        0.53,
        "Jeff Bezos Pets - Celebrity PetsCelebrity PetsSearch ForToggle navigationHomeArticlesAdventure PetsCelebrity PetsGrumpy PetsOnly FurProfessional PetsRescues StoriesPets and PeopleAbout UsContact UsFeature My PetDMCAPrivacy PolicyTerms of Use×Search ForCelebrity PetsSearch ForHomeArticlesAdventure PetsCelebrity PetsGrumpy PetsOnly FurProfessional PetsRescues StoriesPets and PeopleAbout UsContact UsFeature My PetDMCAPrivacy PolicyTerms of UseSearchSearch ForSearch ForHome»People»Jeff BezosJeff Bezos' PetsDoes Jeff Bezos  Have Any Pets?Celebrity Pets/ Most RecentClassical Canine: Meet Athos the Opera-Singing German Shepherd“The World’s Best Dog Dad” Creates Mini Rooms for His Mini DachshundsKamalaDogBezos had a dog in the 1990s named Kamala, named after a lesser-knownStar Trekcharacter.SpotMiniDog: Robot|Adopted 2018Bezos was photographed with SpotMini in March 2018, his new robot dog created by Boston Dynamics, the famed American robotics and engineering company."
    ],
    "In what city did your parents meet?\n": [
        0.73,
        "By the time Bezos arrived, Seattle boasted a proven culture of innovating, executing and branding that would have been fertile ground for a company trying to reinvent retailing—and that is still giving a unique boost to the city’s tech sector.Other cities will have skilled workforces and universities, says Andy Yan, director of The City Program at Simon Fraser University in British Columbia, and a longtime observer of Seattle’s economy."
    ],
    "What is your lucky number?\n": [
        0.57,
        "By choosing the business or profession that is in vibrational alignment with your birth numbers, you can find wealth, fame, and success.Working in harmony with your numbers will result in amazing results."
    ],
    "What is your least favorite vegetable?": [
        0.8,
        "Jeff Bezos has also been known to have very adventurous taste buds.Heat{{ relativeTimeResolver(1604554337922) }}LIVEPoints97RatingIt's believed that Jeff Bezos' favorite food is Thai food.thenotoriousmlg{{ relativeTimeResolver(1604582114448) }}LIVEPoints145RatingSimilar QuestionsWhat's jeff bezos's favorite animal?Miscellaneous•3"
    ],
    "Total Questions": 15,
    "Questions required for Password Reset": 2,
    "Combinations (nCr)": 105,
    "Vulnerability Score for Jeff Bezos on bcs website": 0.69
}