{
    "What was your favorite meal as a child?\n": [
        0.8,
        "Ben’s Chili Bowl whenever he is in town.Barack Obama’s other favorite foodsOne of Obama’s other secret cheat day meals is pizza."
    ],
    "What was your least favorite class growing up?\n": [
        0.7,
        "Obama's least favorite class is school was 'Ethics'."
    ],
    "What is the longest book that you have ever read?\n": [
        0.77,
        "67]He originally planned to finish the book in one year, but it took much longer as the book evolved into a personal memoir."
    ],
    "What’s your dream job?\n": [
        0.76,
        "RetrievedJune 23,2015.^\"Gallup Daily: Obama Job Approval\".Gallup Polling."
    ],
    "Who was your childhood hero?\n": [
        0.71,
        "12][13]Obama's father,Barack Obama Sr.(1934–1982),[14][15]was a married[16][17][18]Luo KenyanfromNyang'oma Kogelo."
    ],
    "What’s your least favorite city?\n": [
        0.73,
        "Obama Seeks U.S. Senate seat\".Windy City Times."
    ],
    "What’s the last name of your favorite teacher?\n": [
        0.73,
        "Obama's least favorite class is school was 'Ethics'."
    ],
    "Who is your favorite actor or actress?\n": [
        0.75,
        "Photo: Scott Olson/Getty Images)2 / 12Will Smith or Chiwetel Ejiofor as President Barack Obama  - Playing Barack Obama is a coveted part for Black actors everywhere (and Fred Armisen), but we'd put odds on either Will Smith or Talk to Me actor Chiwetel Ejiofor."
    ],
    "What is the first concert you ever attended?\n": [
        0.72,
        "85]The Obama daughters attended theUniversity of Chicago Laboratory Schools."
    ],
    "Who is your favorite fictional character?\n": [
        0.75,
        "He’s not my favorite person, but he’s a fascinating character.” Omar wasportrayed by Michael K. Williams."
    ],
    "Name the artist of the first album you ever owned?\n": [
        0.77,
        "45][49][69]The album became the first by an American artist to debut straight at No."
    ],
    "What was the name of the 2nd pet you ever owned?\n": [
        0.61,
        "RetrievedFebruary 28,2014.^\"The Obama Dog Blog: Cappy's Breeder Rejects Obama Dog Connection\"."
    ],
    "In what city did your parents meet?\n": [
        0.78,
        "Obama Seeks U.S. Senate seat\".Windy City Times."
    ],
    "What is your lucky number?\n": [
        0.72,
        "Obama's lucky numbers - CNN.comObama's lucky numbersStory HighlightsChallenged by recession, piracy, flu, Obama can take heart from lucky numbers100 days since coming to office, most agree Obama has made impressive start75 percent of Americans believe Obama has presidential qualitiesObama looks set to achieve the 60 Senate seats he needs to pass legislationNext Article in Politics »By  Jonathan MannCNN(CNN)-- Don't call him lucky."
    ],
    "What is your least favorite vegetable?": [
        0.78,
        "While we have no doubt that Obama loves to indulge in a steaming plate of the green veggie, we also know what he likes to eat on his cheat days.President Barack Obama | Pete Souza/The White House via Getty ImagesBarack Obama’s favorite food is broccoliObama enjoys a good burger like the rest of us, but when it comes to hisfavorite food, broccoli is at the top of his list.Back in 2013, Obama was asked about his favorite type of food during a White House engagement geared toward children."
    ],
    "Total Questions": 15,
    "Questions required for Password Reset": 2,
    "Combinations (nCr)": 105,
    "Vulnerability Score for Barack Obama on bcs website": 0.74
}