{
    "What was your favorite meal as a child?\n": [
        0.67,
        "I thought Will was a hero in this particular episode because he taught children a good lesson.Willard Christopher Smith Jr. was born into a loving family in Philadelphia."
    ],
    "What was your least favorite class growing up?\n": [
        0.72,
        "However, I grew up with Will on my television and I always liked him."
    ],
    "What is the longest book that you have ever read?\n": [
        0.76,
        "Probably more than all the others I've read together."
    ],
    "What’s your dream job?\n": [
        0.69,
        "Your job is to lay this brick perfectly."
    ],
    "Who was your childhood hero?\n": [
        0.78,
        "Again, a hero doesn't have to be famous."
    ],
    "What’s your least favorite city?\n": [
        0.62,
        "My two favorite cities on earth are Dubai and Miami,\" Smith said when asked if he loves Dubai."
    ],
    "What’s the last name of your favorite teacher?\n": [
        0.68,
        "actor...Adam SandlerMore advice inEntertainmentEntertainmentWho is your favorite actress?Who's your favorite celebrity?Who are your favorite comedians?Who is your favorite celebrity?what are all of your favorite movies??"
    ],
    "Who is your favorite actor or actress?\n": [
        0.96,
        "who is your favorite actor and actress."
    ],
    "What is the first concert you ever attended?\n": [
        0.62,
        "Medina invited Smith to meet Jones at a party that Jones was throwing at his house in December 1989."
    ],
    "Who is your favorite fictional character?\n": [
        0.74,
        "There are so many things that make him my favorite actor, but I can's list them all, basically will smith the actor is my favorite.You could easily distinguish whatever characters he plays."
    ],
    "Name the artist of the first album you ever owned?\n": [
        0.72,
        "Will Smith discography - WikipediaJump to contentMain menuMain menumove to sidebarhideNavigationMain pageContentsCurrent eventsRandom articleAbout WikipediaContact usDonateContributeHelpLearn to editCommunity portalRecent changesUpload fileLanguagesLanguage links are at the top of the page across from the title.SearchCreate accountLog inPersonal toolsCreate accountLog inPages for logged out editorslearn moreContributionsTalkContentsmove to sidebarhide(Top)1AlbumsToggle Albums subsection1.1Studio albums1.2Compilation albums1.3Video albums2SinglesToggle Singles subsection2.1As lead artist2.2As featured artist2.3Promotional singles2.4Other charted songs3Guest appearances4Music videos5See also6Notes7References8External linksToggle the table of contentsToggle the table of contentsWill Smith discography5 languagesČeštinaDeutschEspañolItalianoPolskiEdit linksArticleTalkEnglishReadEditView historyToolsToolsmove to sidebarhideActionsReadEditView historyGeneralWhat links hereRelated changesUpload fileSpecial pagesPermanent linkPage informationCite this pageWikidata itemPrint/exportDownload as PDFPrintable versionFrom Wikipedia, the free encyclopediaFor Smith's recordings made with DJ Jazzy Jeff, seeDJ Jazzy Jeff & The Fresh Prince discography.Will SmithdiscographyWill Smith at the close of the 2018 FIFA World CupStudio albums4Compilation albums1Video albums1Music videos20Singles18American rapperWill Smithhas released fourstudio albums, onecompilation album, 18singles(12 as lead artist and five as featured artist), onevideo albumand 20music videos(14 as lead artist, three as featured artist and three guest appearances)."
    ],
    "What was the name of the 2nd pet you ever owned?\n": [
        0.62,
        "The 14th NY Pet Fashion Show is Much More Adorable and AmazingBarbra Streisand cloned her dog, spending up to $500,000Hero Accountant Runs a Pet  and Dog Retirement Home for \"Unadoptables\"Gunther VI, World's Richest Dog, Buys Nicolas Cage's Private Island in the BahamasCelebrity PetsRelatedAlica Schmidt PetsBrandon Frazier PetsHulk Hogan PetsAndy Serkis PetsDavid Attenborough PetsJacob Tremblay PetsKarl Urban PetsHannah Kepple PetsZoe Chao PetsJeffrey Dean Morgan PetsHayley Williams PetsZiggy Marley PetsMenuHomeArticlesFeature My PetTerms Of UseAbout UsContact UsDMCAPrivacy PolicyPopular TagsActorsMusiciansAthletesCreatorsComediansDogsCatsBirdsCrittersHorsesTop© 2023 Celebrity Pets / All Rights Reserved."
    ],
    "In what city did your parents meet?\n": [
        0.72,
        "144]Smith and his family also met and spent time with the Indian spiritual leaderSadhguru, stating that he enjoyed the heartfelt conversations between them."
    ],
    "What is your lucky number?\n": [
        0.78,
        "My lucky number is ‎nine,\" wrote John."
    ],
    "What is your least favorite vegetable?": [
        0.9,
        "NewsChannel10 - What's your least favorite vegetable?"
    ],
    "Total Questions": 15,
    "Questions required for Password Reset": 2,
    "Combinations (nCr)": 105,
    "Vulnerability Score for Will Smith on bcs website": 0.73
}