{
    "What was your favorite meal as a child?\n": [
        0.79,
        "Her mom's \"chicken, with rice and gravy\" is William's favorite dish — and has been since she was a young child."
    ],
    "What was your least favorite class growing up?\n": [
        0.76,
        "Serena grew up in Compton, which was not a wealthy neighborhood."
    ],
    "What is the longest book that you have ever read?\n": [
        0.83,
        "We’ve rounded up some books authored by our champ as well as other books about her that you should definitely read. On the Line by Serena Williams"
    ],
    "What’s your dream job?\n": [
        0.78,
        " \"Williams sisters' parents deserve accolades for job well-done\"."
    ],
    "Who was your childhood hero?\n": [
        0.8,
        "Why Serena Williams’ Heroes in Life ‘Changed’ After Motherhoodby Greg Brian She turned around and watched the program roll vintage footage of the actress Eartha Kitt, who in 1967 became the first African American woman to star as the comic book character in the TV series Batman."
    ],
    "What’s your least favorite city?\n": [
        0.93,
        "Serena’s favorite city is Rome."
    ],
    "What’s the last name of your favorite teacher?\n": [
        0.85,
        "Related questionsWhat is Serena Williams's favorite movie?soul planWhat is Serena Williams favorite city?ParisWhat is Serena Williams's favorite color?pink!What is Serena Williams favorite candy?kitkatSerena Williams' favorite color?orangeWhen did Serena Williams begin The Serena Williams foundation?Yes they also made a movie called \"Serena Williams Journey Back"
    ],
    "Who is your favorite actor or actress?\n": [
        0.71,
        "What is Serena Williams favorite movie?"
    ],
    "What is the first concert you ever attended?\n": [
        0.74,
        "In 1991 the family moved to Florida so that Serena and Venus Williams could attend a tennis academy."
    ],
    "Who is your favorite fictional character?\n": [
        0.76,
        "Williams has followed She-Ra now for almost a decade. Fierce characters or stories have always fascinated the legendary tennis player."
    ],
    "Name the artist of the first album you ever owned?\n": [
        0.75,
        "Serena Williams reveals to Rolling Stones her favorite Music band and artists"
    ],
    "What was the name of the 2nd pet you ever owned?\n": [
        0.65,
        "In addition to Lauerlei, Williams owns another dog named Christopher \"Chip\" Rafael Nadal."
    ],
    "In what city did your parents meet?\n": [
        0.86,
        "As the city where she met her lifelong partner, Rome will forever have Williams' heart."
    ],
    "What is your lucky number?\n": [
        0.84,
        "\t\t\t\tLucky number 700 for Serena Williams"
    ],
    "What is your least favorite vegetable?": [
        0.82,
        "Related questionsWhat is Serena Williams's favorite movie?soul planWhat is Serena Williams favorite city?ParisWhat is Serena Williams's favorite color?pink!What is Serena Williams favorite candy?kitkatSerena Williams' favorite color?orangeWhen did Serena Williams begin The Serena Williams foundation?Yes they also made a movie called \"Serena Williams Journey Back"
    ],

    "Total Questions": 15,
    "Questions required for Password Reset": 2,
    "Combinations (nCr)": 105,
    "Vulnerability Score for serena williams on Blue Cross Sheild website": 0.7913333333333333
}