{
    "What is your paternal grandmother’s first name?\n": [
        0.84,
        "Is Richard Williams Still Married to Serena Williams' Mother?"
    ],
    "What is your father’s middle name?\n": [
        0.85,
        "What is serena williams middle name?"
    ],
    "What is the city of your first school?\n": [
        0.71,
        "And to this day, the Williams sisters are a source of pride in the city."
    ],
    "What is the name of the street on which you lived when you were 5 years old?\n": [
        0.8,
        "Yes, if you ever want to join the 39-year-old pro-athlete and 3-year-old Alexis Olympia Ohanian on one of their adventures, just scroll through Williams' Instagram feed."
    ],
    "What is the name of your favorite restaurant?\n": [
        0.74,
        "It’s my favorite place in the world!What’s your first (or favorite) memory of Rome?Meeting my husband, Alexis.What restaurants or meals from Rome do you crave most?L’Isola della Pizza."
    ],
    "What is the first car you owned?\n": [
        0.8,
        "Safe to say Serena likes her cars, take a closer look at them here.Latest Automotive News:-Kendall Jenner's Car CollectionHere’s A Look At O. J. Simpson’s 2023 Car Car CollectionClassic Car Collection of Hollywood Legend James Cagney5."
    ],
    "What is your first pet’s name?\n": [
        0.76,
        "Give your dog, cat, pet a big hug."
    ],
    "What is your mother’s maiden name?\n": [
        0.85,
        "Is Richard Williams Still Married to Serena Williams' Mother?"
    ],
    "What is the name of your first school?\n": [
        0.76,
        "Lionel Messsi and Serena Williams join Unicef children's education campaign\".International Business Times.^\"Serena Williams Launches UNICEF's Schools for Asia\".Ecorazzi."
    ],
    "What is your favorite vacation spot?": [
        0.75,
        "Serena Williams Perfect Day - Serena Williams Favorite Spots | Marie ClaireMarie ClaireMarie Claire×SearchFashionBeautyCultureMoney & CareerPoliticsMoreHealth & fitnessCelebrityFood & CocktailsTravelLove & SexHomePromo CodesSubscribeShoplogo MCETrendingPaid LeavePrix AwardsMetallics'Kill Boksoon'When you purchase through links on our site, we may earn an affiliate commission.Here’s how it works.HomeCelebrityWhat Serena Williams Loves to Eat, Where She Loves to Shop, and How She Loves to SplurgeWith her eye on completing a Grand Slam at this month's U.S. Open, the world's number-one-ranked women's tennis ace reveals her favorite spots."
    ],
    "Total Questions": 10,
    "Questions required for Password Reset": 1,
    "Combinations (nCr)": 10,
    "Vulnerability Score for Serena Williams on spectrum website": 0.79
}