{
    "What is your paternal grandmother’s first name?\n": [
        0.64,
        "As a young woman Haldeman was a finalist in the 1969 Miss South Africa beauty competition. In 1970 she married Errol Musk born May 2 1946 a South African engineer she met in high school. They had three children Elon Musk Kimbal Musk andTosca Musk. She named Elon after her American grandfather John Elon Haldeman born inIllinois ."
    ],
    "What is your father’s middle name?\n": [
        0.74,
        "As a young woman Haldeman was a finalist in the 1969 Miss South Africa beauty competition. In 1970 she married Errol Musk born May 2 1946 a South African engineer she met in high school. They had three children Elon Musk Kimbal Musk andTosca Musk. She named Elon after her American grandfather John Elon Haldeman born inIllinois ."
    ],
    "What is the city of your first school?\n": [
        0.69,
        "He also confessed that he wasbulliedtremendously in school as a child growing up in South Africa.Though Elon Musk has now moved to Texas the Ad Astra school remains at the California SpaceXfacility."
    ],
    "What is the name of the street on which you lived when you were 5 years old?\n": [
        0.76,
        "At the time Errol was working in construction and emerald mining according to Rolling Stone.Errolmade headlines in 2018when it was revealed that he had a child with his then 30 year old former stepdaughter Jana Bezuidenhout whom he s known since she was 4 years old."
    ],
    "What is the name of your favorite restaurant?\n": [
        0.71,
        "Each bite of the Cordero chops was bursting with a rich and buttery flavor profile that felt like a perfect marriage of the garlic herbs and lemon that are used in the dish.The flavors added to the Cordero enhanced the meat s natural flavor.Katherine Stinson InsiderOne of the other options Musk ordered was the Angels on Horseback three bacon wrapped shrimp with white cheese and jalapeno served with a housemade escabeche sauce a citrusy marinade seasoned with spices like paprika ."
    ],
    "What is the first car you owned?\n": [
        0.83,
        "The Truth About The First Car Elon Musk Ever Owned NEWSTECHCARSGAMINGENTERTAINMENTSCIENCEHEALTHREVIEWSFEATURESAboutEditorial PoliciesPrivacy PolicyTerms of Use 2023Static Media ."
    ],
    "What is your first pet’s name?\n": [
        0.71,
        "Elon Musk Pets Celebrity PetsCelebrity PetsSearch ForToggle navigationHomeArticlesAdventure PetsCelebrity PetsGrumpy PetsOnly FurProfessional PetsRescues StoriesPets and PeopleAbout UsContact UsFeature My PetDMCAPrivacy PolicyTerms of Use Search ForCelebrity PetsSearch ForHomeArticlesAdventure PetsCelebrity PetsGrumpy PetsOnly FurProfessional PetsRescues StoriesPets and PeopleAbout UsContact UsFeature My PetDMCAPrivacy PolicyTerms of UseSearchSearch ForSearch ForHome People Elon MuskElon Musk s PetsDoes Elon Musk Have Any Pets Celebrity Pets Most RecentSubway Hack Woman Carries 52 Lbs."
    ],
    "What is your mother’s maiden name?\n": [
        0.67,
        "As a young woman Haldeman was a finalist in the 1969 Miss South Africa beauty competition. In 1970 she married Errol Musk born May 2 1946 a South African engineer she met in high school. They had three children Elon Musk Kimbal Musk andTosca Musk. She named Elon after her American grandfather John Elon Haldeman born inIllinois ."
    ],
    "What is the name of your first school?\n": [
        0.67,
        "Ad Astra The Secret School Elon Musk Started To Save His Kids From Standard EducationNewsPublic School NewsSchool Choice NewsHomeschool NewsCollege NewsBad TeachersKnowledgeEducation TerminologyCurriculumAd Astra The Secret School Elon Musk Started To Save His Kids From Standard EducationO of Tesla and SpaceX Elon Musk views life."
    ],
    "What is your favorite vacation spot?": [
        0.69,
        "Shirtless Elon Musk vacations in Mykonos on luxury yachtSkip to main contentThanks for contacting us."
    ],
    "Total Questions": 10,
    "Questions required for Password Reset": 1,
    "Combinations (nCr)": 10,
    "Vulnerability Score for Elon Musk on spectrum website": 0.71
}