{
    "What is your paternal grandmother’s first name?\n": [
        0.7,
        "How Will Smith’s Christian Grandmother Made An Impact On His CareerOpen menuHomeStationsThe ShowEricaismFaith WalkingGRIFF’s PicksGRIFF’s PrayerHealthy Ever AfterInterviewsJoy LivingLove TalkingMr."
    ],
    "What is your father’s middle name?\n": [
        0.76,
        "Apparently, Copeland is his mother'smaiden name!16.Hilary Duff's middle name is Erhard.Dia Dipasupil / Getty ImagesHer full name is Hilary Erhard Duff.17.Henry Cavill's middle name/names are William Dalgliesh.Gareth Cattermole / Getty ImagesHis full name is Henry William Dalgliesh Cavill.18.One of Jude Law's middle names is Heyworth.Dave J Hogan / Getty ImagesHis full name is David Jude Heyworth Law.19.Courteney Cox's middle name is Bass.Jon Kopaloff / Getty ImagesHer full name is Courteney Bass Cox.20.Kate Beckinsale's middle name is Romany.Joe Maher / Getty ImagesHer full name is Kathrin Romany Beckinsale.21.One of Hugh Grant's middle names is Mungo.Kevin Winter / Getty ImagesHis full name is Hugh John Mungo Grant.22.Nicolas Cage's middle name is Kim.Taylor Hill / FilmMagic / Getty ImagesHis full name is Nicolas Kim Coppola.23.Leonardo DiCaprio's middle name is Wilhelm.Taylor Hill / FilmMagic / Getty ImagesHis full name is Leonardo Wilhelm DiCaprio.24.Billie Piper's middle name is Paul.Gareth Cattermole / Gareth Cattermole / Getty Images for BFCHer birth name was Leian Paul Piper, but her parents legallychangedher first name from Leian to Billie months after she was born.25.Daniel Craig's middle name is Wroughton.Jamie Mccarthy / Getty ImagesHis full name is Daniel Wroughton Craig.26.Zach Galifianakis's middle name is Knight.Rodin Eckenroth / Getty ImagesHis full name is Zachary Knight Galifianakis.27.Blake Lively's middle name is Ellender.Taylor Hill / Getty ImagesHer birth name is Blake Ellender Brown.28.Richard Gere's middle name is Tiffany.Dimitrios Kambouris / Getty Images for City HarvestHis full name is Richard Tiffany Gere.29.Quincy Jones's middle name is Delight.Amy Sussman / Getty ImagesHis full name is Quincy Delight Jones Jr.30.One of Billie Eilish's middle names is Pirate.Taylor Hill / Getty ImagesHer full name is Billie Eilish Pirate Baird O'Connell.And lastly...31.Nick Jonas's middle name is Jerry.Michael Kovac / Getty Images for Sugar Ray Leonard FoundationHis full name is Nicholas Jerry Jonas.Did any of these middle names surprise you?"
    ],
    "What is the city of your first school?\n": [
        0.76,
        "4]Prior to New Village Academy, Smith and Pinkett Smith's two children were home-schooled by their mother."
    ],
    "What is the name of the street on which you lived when you were 5 years old?\n": [
        0.77,
        "A 7-year-old doesn’t know what’s right or what’s wrong."
    ],
    "What is the name of your favorite restaurant?\n": [
        0.68,
        "Will Smith Returns Home, Gets an Overbrook Pizza Cheesesteak - Eater PhillySkip to main contentclockmenumore-arrownoyesmobileEater Philly homepagePhiladelphiaFollow Eater Philly online:Follow Eater Philly on TwitterFollow Eater Philly on FacebookFollow Eater Philly on YoutubeFollow Eater Philly on InstagramSubscribeLog in or sign upLog InSign UpSite searchSearchSearchEater Philly main menuCitiesMapsOpeningsNeighborhoodsVideoFeaturesMoreCitiesAtlantaAustinBostonCarolinasChicagoDallasDenverDetroitHoustonLas VegasLos AngelesMiamiNashvilleNew OrleansNew YorkPhiladelphiaPhoenixPortland, ORSan DiegoSan FranciscoSeattleTwin CitiesWashington DCEater.comMapsOpeningsNeighborhoodsVideoFeatures✕Filed under:Will Smith Returns Home, Gets an Overbrook Pizza CheesesteakAnd Billy Baldwin ate dinner at ParadisobyAlex TewfikApr 26, 2016, 10:34am EDTViaParadiso [Facebook],Overbrook Pizza [Facebook], andAll Previous StarWatch Coverage [EPHL]Share this storyShare this on FacebookShare this on TwitterShareAll sharing optionsShareAll sharing options for:Will Smith Returns Home, Gets an Overbrook Pizza CheesesteakPocketFlipboardEmailPhilly homeboyWill Smithwas in town last night, and the movie star had a hankering for a cheesesteak."
    ],
    "What is the first car you owned?\n": [
        0.82,
        "An incredible scene in which the character drives the car through the deserted streets of New York City is definitely memorable—at least for car aficionados, that is.15WILL'S 1965 FORD MUSTANGVIA bringatrailer.comBut the car inI Am Legendisn't the Shelby that Will owns and possesses in his own garage back home."
    ],
    "What is your first pet’s name?\n": [
        0.7,
        "Wife of actor Will Smith and also sings with her rock soul band Wicked Wisdom.Find us on FacebookDogsDog NamesFemale Dog NamesMale Dog NamesCatsCat NamesFemale Cat NamesMale Cat NamesPet InsuranceSelectadogbreed.comAboutAbout UsContact UsSitemapDogsDog NamesFemale Dog NamesMale Dog NamesCatsCat NamesFemale Cat NamesMale Cat NamesPet InsuranceSelectadogbreed.comAboutAbout UsContact UsSitemapProtect your newfamily member from the start!Bow Wow Meow Pet Insuranceoffers up to 80% rebate for eligibleillnesses & accidents.Get 2 months freein your first year*Get a quick quoteUse promo code NAMP2"
    ],
    "What is your mother’s maiden name?\n": [
        0.77,
        "And with marriage equality, there may be two husbands or two wives, rendering the concept of a “maiden name” even more old-fashioned.My youngest son’s surname comprises my wife’s surname, followed by mine."
    ],
    "What is the name of your first school?\n": [
        0.81,
        "And our school is not, and I repeat, not a Scientology school."
    ],
    "What is your favorite vacation spot?": [
        0.74,
        "It’s hard to complain, though, as his adventures at the Opera House, the Bridge climb, and at brunch atPorch and Parlourin Bondi Beach will inspire anyone to visit the far away continent.ShareTweetPinLinkedInPrevious PostChristian Bale On VacationNext Post3 Spots to Vacation Like Drew BarrymoreNEXT ARTICLE3 Spots to Vacation Like Drew BarrymoreBy Joelle MentisJune 1, 2022MoreBOOK MY TRIP NOWStaysFlightsCarsCheck-inCheck-outSearchPowered by ExpediaPrevious PostChristian Bale On VacationNext Post3 Spots to Vacation Like Drew BarrymoreNEXT ARTICLE3 Spots to Vacation Like Drew BarrymoreBy Joelle MentisJune 1, 2022MoreTRENDING ON GALAVANTEEvents & TastemakersTop Chef Eric AdjepongFOODRamp Matzo Ball SoupTravel BuzzSouthall Opens in TennesseeStyleSetting the Perfect TableFamily Travel,Luxury Family Travel & LifestyleMauna Lani: A Family Trip to HawaiiRoad TripThe Retreat: Joshua TreeThe SpecialWhere to Eat in GuatemalaTHE WEEKLYBE IN THE KNOW.TRAVEL."
    ],
    "Total Questions": 10,
    "Questions required for Password Reset": 1,
    "Combinations (nCr)": 10,
    "Vulnerability Score for Will Smith on spectrum website": 0.75
}