{
    "What is your paternal grandmother’s first name?\n": [
        0.86,
        "121]Sarah Onyango Obama (1922–2021)Main article:Sarah Onyango ObamaSarah Onyango Obama was the third wife of Obama's paternal grandfather."
    ],
    "What is your father’s middle name?\n": [
        0.85,
        "An activity summarizes his life, contributions and achievements.Related to this QuestionWhat is Barack Obama's full name?What is Bill Clinton's middle name?What is Ronald Reagan's middle name?What was Harry Truman's middle name?What was George Washington's middle name?What is Gerald Ford's middle name?What is Jimmy Carter's middle name?What was President Andrew Jackson's middle name?Who is Barack Obama's father?What was President John Adams' middle name?What is President Thomas Jefferson's middle name?What is James Buchanan's middle name?What is the middle name of John F. Kennedy?What is Andrew Johnson's middle name?Who is Barack Obama?What did Barack Obama do in his first term?Did Theodore Roosevelt have a middle name?Did Harry Truman have a middle name?What state is Barack Obama from?What is John Tyler's middle name?What state was Barack Obama Senator of?What was Booker T. Washington's middle name?What is James Monroe's middle name?What is the name of the U.S. president now?What is Barack Obama's undergraduate degree?What are some intersting facts about Barack Obama?What is Newt Gingrich's full name?What is James Madison's middle name?What is Rutherford B. Hayes' middle name?What number president is Barack Obama?What was Barack Obama's childhood like?Who was the president before Barack Obama?What is Barack Obama famous for?What is Barack Obama's birthday?What did Barack Obama do after his presidency?What did Barack Obama do as a child?What president was before Obama?What was Ulysses S. Grant's middle name?What president named the White House?What was Ronald Reagan's full name?Who was the first president in Kenya?What is John F. Kennedy's full name?What is George W. Bush nickname?What is Millard Fillmore's full name?What was Ronald Reagan's brothers name?What kind of lawyer was Barack Obama?What is George H.W."
    ],
    "What is the city of your first school?\n": [
        0.81,
        "Obama has 17 schools named after him with some shared with former first lady Michelle Obama.Check them out below.CaliforniaBarack Obama Charter School  (Compton) 2009Barack Obama Global Preparation Academy  (Los Angeles)  2018Barack Obama Academy (Oakland) 2009Related StoryVirginia Rapper Sentenced To 5 Months For Capitol Riot Album ArtConnecticutBarack H. Obama Magnet University School  (New Haven) 2010GeorgiaBarack H. Obama Elementary Magnet School of Technology (Atlanta) 2017Barack and Michelle Obama Academy (Atlanta) 2016MarylandBarack Obama Elementary School (Upper Marlboro) 2009MississippiBarack Obama International Baccalaureate Elementary School (Jackson) 2017MissouriBarack Obama Elementary School (Pine Lawn) 2011MinnesotaBarack and Michelle Obama Service Learning Elementary (Saint Paul, Minnesota) 2009New JerseyBarack Obama Academy (Plainfield) 2010Barack Obama Green Charter High School (Plainfield) 2010New YorkBarack Obama Elementary School (Hempstead) 2010OhioBarack Obama Elementary School (Maple Heights), 2012PennsylvaniaObama High School (Pittsburgh) 2011TexasBarack Obama Male Leadership Academy (Dallas) 2011WisconsinBarack Obama School for Career and Technical Education (Milwaukee) 2017Get weekly rundowns straight to your inboxSubscribeRead More AboutBarack ObamavirginiaThe Vibe NewsletterGet weekly rundowns straight to your inboxEmail AddressSubscribeSign UpBy subscribing, I agree to theTerms of UseandPrivacy Policy."
    ],
    "What is the name of the street on which you lived when you were 5 years old?\n": [
        0.79,
        "He spent time with the old man only once, when he was 10, for an unsatisfying month."
    ],
    "What is the name of your favorite restaurant?\n": [
        0.75,
        "Outside the Beltway, he seems to like the Charcoal Pit in Wilmington, Delaware, and Charlie’s Sandwich Shoppe in Boston.Steak restaurants like Washington D.C.’s Bourbon Steak and BLT Steak are also joined by two hometown favorites — Buzz’s Lanikai in Hawaii and RPM Steak in Chicago.Obama’s most popular guests were first lady Michelle Obama and friends, followed closely by just Michelle."
    ],
    "What is the first car you owned?\n": [
        0.83,
        "Senator representing Illinois during the time he owned the car."
    ],
    "What is your first pet’s name?\n": [
        0.77,
        "RetrievedFebruary 28,2014.^\"The Obama Dog Blog: Cappy's Breeder Rejects Obama Dog Connection\"."
    ],
    "What is your mother’s maiden name?\n": [
        1.0,
        "What was barack obama's mother's maiden name?"
    ],
    "What is the name of your first school?\n": [
        0.89,
        "RetrievedSeptember 27,2018.^\"Oakland School Renamed Barack Obama Academy\"."
    ],
    "What is your favorite vacation spot?": [
        0.88,
        "All Rights ReservedUS Presidents' Favorite Vacation Spots GalleryNewsExclusivesRecipesKitchenCultureFactsGroceryRestaurantsHolidaysFeaturesCultureUS Presidents' Favorite Vacation Spots Galleryistockphoto.comBySyjil Ashraf|Feb."
    ],
    "Total Questions": 10,
    "Questions required for Password Reset": 1,
    "Combinations (nCr)": 10,
    "Vulnerability Score for Barack Obama on spectrum website": 0.84
}