{
    "What is your paternal grandmother’s first name?\n": [
        0.63,
        "Mike Bezos was a Cuban immigrant, who moved to USA just a few months back.Jacklyn (née Gise)Jacklyn is Jeff Bezos’ mother, who married Ted Jorgensen when she was just sixteen."
    ],
    "What is your father’s middle name?\n": [
        0.73,
        "He was also named after his father’s middle name, Jeffrey Preston Bezos.Jeff Bezos and his son Preston at the American Portrait Gala, in 2019."
    ],
    "What is the city of your first school?\n": [
        0.66,
        "29][30]The family moved toMiami, Florida, where Jeff attendedMiami Palmetto High School."
    ],
    "What is the name of the street on which you lived when you were 5 years old?\n": [
        0.8,
        "In my 10-year-old-mind, I had been extremely clever to do this."
    ],
    "What is the name of your favorite restaurant?\n": [
        0.72,
        "It was even named \"Tom's Favorite Breakfast\" after the chef."
    ],
    "What is the first car you owned?\n": [
        0.75,
        "Jeff Bezos Owns a 1997 Honda AccordSkip to main contentAdvertisementMotorBiscuitExpand SearchCollapse SearchSearch for:SearchMenuTrucksSUVsHybrids & ElectricsSedans & CoupesTips, Tricks & Trends2 WheelsVehicle ReviewsFollowInstagramYoutubeFacebookTwitterAbout UsPrivacy PolicyTerms of ServiceWeb AccessibilityShowbiz Cheat SheetEndgame360SportscastingTrucksSUVsHybrids & ElectricsSedans & CoupesTips, Tricks & Trends2 WheelsVehicle ReviewsSwipeHome/Sedans & Coupes/SedansJeff Bezos Owns a 1997 Honda AccordbyErik Sherman|More Articles: SedansPublished onJune 22, 2022Share:Jeff Bezos is one of the wealthiestcelebritieson the planet, yet he drives a shockingly understated car."
    ],
    "What is your first pet’s name?\n": [
        0.57,
        "This adorable pup has more than 11,700 followers on Instagram.Instagram CEO Kevin Systrom poses with his golden retriever, Dolly.Instagram, @dollySource: Instagram,@dollyNot to be outdone by his Instagram cofounder, Mike Krieger has his own puppy, a 5-month-old Bernese mountain dog named Juno.Instagram, @junopupSource: Instagram,@junopupRichard Branson keeps all kinds of animals as pets on his private Caribbean escape, Necker Island."
    ],
    "What is your mother’s maiden name?\n": [
        0.69,
        "Her father was a financial planner, while her mother was a homemaker."
    ],
    "What is the name of your first school?\n": [
        0.64,
        "29][30]The family moved toMiami, Florida, where Jeff attendedMiami Palmetto High School."
    ],
    "What is your favorite vacation spot?": [
        0.67,
        "Jeff Bezos Spotted on Date Night at Rasika DCSectionsNews & PoliticsFoodThings to DoWashingtonian EventsHome & StyleEditors’ PicksEvents CalendarHealthLongreadsParentingReal EstateShoppingTravelWeddingsReader Favorites100 Very Best RestaurantsDC-Area Events CalendarBrunchNeighborhoodsNewslettersDirectoriesWashingtonian EventsWashington’s BestApartment RentalsDC Travel GuideDentistsDoctorsFinancial AdvisersHealth ExpertsHome Improvement ExpertsIndustry LeadersLawyersMortgage ProfessionalsPet CarePrivate SchoolsReal Estate AgentsRestaurantsRetirement CommunitiesWedding Vendors© 2023 Washingtonian Media Inc.Privacy PolicyAll Rights ReservedRssSkip to contentSearchSubscribeMenuSubscribeReader Favorites100 Very Best RestaurantsDC-Area Events CalendarBrunchNeighborhoodsNewslettersDirectoriesWashingtonian EventsMoreSubscribeManage My SubscriptionDigital EditionShopContestsAbout UsAdvertisingContact UsJobsSectionsNews & PoliticsFoodThings to DoWashingtonian EventsHome & StyleEditors’ PicksEvents CalendarHealthLongreadsParentingReal EstateShoppingTravelWeddingsNews & PoliticsThings to DoFoodHealthShoppingHome & StyleReal EstateWeddingsTravel100 Very Best RestaurantsDC-Area Events CalendarBrunchNeighborhoodsNewslettersDirectoriesWashingtonian EventsTrending Now in FoodRAMMY AwardsLucha RosaKirby ClubLauriol PlazaJohn FulchinoFoodJeff Bezos Spotted on Date Night at DC’s RasikaBezos and girlfriend Lauren Sánchez lingered for over two hours at the luxe Indian restaurant.Written byAnna Spiegel| Published onJanuary 20, 2023TweetShareJeff Bezos."
    ],
    "Total Questions": 10,
    "Questions required for Password Reset": 1,
    "Combinations (nCr)": 10,
    "Vulnerability Score for Jeff Bezos on spectrum website": 0.69
}