{
    "Who is your favorite artist?\n": [
        0.71,
        "Ripple’ is one of my favorite songs of all time.” Martin’s also rankedThe Wizard of Ozashis third-favorite fantasy film, with one reason being that “the music is marvelous.”Neil deGrasse TysonFavorite artists:Aretha Franklin, Koko Taylor, Van MorrisonDr."
    ],
    "What is your favorite warm weather activity?\n": [
        0.69,
        "Amazon.com'sMoodMatcherrecommends the best tunes to keep you rolling from Boston to L.A.--or for any other activity or occasion, from aerobics to cocktail parties.3."
    ],
    "What is your favorite musical instrument?\n": [
        0.84,
        "My favorite subject is music."
    ],
    "What color was the home you grew up in?\n": [
        0.72,
        "Now worth a billion dollars, the multitalented creator of theMadeamovie franchise came into the world on 13 September 1969 and grew up in a compact two-bedroom, one-bathroom Victorian shotgun house in New Orleans' Faubourg Delassize neighbourhood.Tyler Perry's New Orleans shotgun houseTyler Perry / FacebookSubjected to an extremely difficult childhood and growing up in poverty, the Hollywood mogul would use his imagination to escape the trauma of his early life, providing the foundation for many of the characters that would go on to make him a billionaire.Tyler Perry's New Orleans shotgun houseRealtor.comThese days, the shotgun house is bright and airy, with towering ceilings and elegant fixtures – no doubt a sight different from the living spaces Tyler grew up in."
    ],
    "What is your favorite type of music?\n": [
        0.84,
        "My favorite subject is music."
    ],
    "What is your favorite flavor of ice cream?\n": [
        0.83,
        "If we go by the company’s website, they serve chocolate, vanilla, and twist soft-serve.As per the grapevine, Bezos is a fan of soft-serve ice cream and he can’t resist it.Are you also a soft-serve ice cream fan?"
    ],
    "What is your favorite type of reading?\n": [
        0.75,
        "My favorite subject is English."
    ],
    "What was your favorite subject in school?\n": [
        0.97,
        "Why is this your favorite school subject?"
    ],
    "What was your favorite fruit or vegetable as a child?\n": [
        0.78,
        "The late CEO also experimented with “fruitarianism,” an extreme vegan diet that consisted of fruits, nuts, seeds, vegetables, and grains."
    ],
    "What musical instrument do you play?\n": [
        0.77,
        "Unlike the modern trombone, the sackbut had a narrower bore and a much smaller flare.It also lacks a water key, bell curve tuning slide, and slide lock.Although both musical instruments are similar, you can’t play the traditional sackbut repertoire on the modern trombone.The first time a trombone was played publicly was at a wedding.In 1468, the Duke of Burgundy, Charles the Bold, married Princess Margaret of England.During the banquet, they had the musicians dress up asanimals."
    ],
    "What was your least favorite subject in school?\n": [
        0.97,
        "Why is this your favorite school subject?"
    ],
    "What is your favorite type of movie?\n": [
        0.67,
        "Bezos: the Beginning’ is out streaming on Amazon Prime, Google Play, Vudu, and as a YouTube rental.Director: Khoa LeaWriters: Allison Burnett, Tashena EbanksCast: Armando Gutierrez, Kevin Sorbo, Alex Mitchell, Sasha AndreevBy Zachary DePioreClick here to readThe Hollywood Insider’sCEO Pritan Ambroase’s love letter to Cinema, TV and Media."
    ],
    "What was your least favorite fruit or vegetable as a child?\n": [
        0.78,
        "The late CEO also experimented with “fruitarianism,” an extreme vegan diet that consisted of fruits, nuts, seeds, vegetables, and grains."
    ],
    "What is your favorite sport?\n": [
        1.0,
        "What's jeff bezos's favorite sport?"
    ],
    "What was the make of your first car?": [
        0.87,
        "World's Richest CEOs and Their Cars | From Jeff Bezos to Mark ZuckerbergSign inJoinHomeLatest Car NewsLatest Bike NewsCar Spy ShotsFeatured ArticlesGoMechanic BasicsGoMechanic Fun ReadsGoMechanic InformativeElectric Car NewsGoMechanic YouTubeBook Your Car ServiceCar AccessoriesSign inWelcome!Log into your accountyour usernameyour passwordForgot your password?Create an accountSign upWelcome!Register for an accountyour emailyour usernameA password will be e-mailed to you.Password recoveryRecover your passwordyour emailSearchTuesday, April 11, 2023FacebookInstagramLinkedinPinterestTwitterYoutubeBlogHomeAuto NewsLatest Bike NewsLatest Car NewsLatest Spy ShotElectric Car NewsFeatured ArticlesGoMechanic BasicsGoMechanic Fun ReadsGoMechanic Informative ArticlesCar AccessoriesGoMechanic VideosService Your CarSearchHomeLatest Car NewsLatest Bike NewsCar Spy ShotsFeatured ArticlesGoMechanic BasicsGoMechanic Fun ReadsGoMechanic InformativeElectric Car NewsGoMechanic YouTubeBook Your Car ServiceCar AccessoriesSign inWelcome!"
    ],
    "Total Questions": 15,
    "Questions required for Password Reset": 1,
    "Combinations (nCr)": 15,
    "Vulnerability Score for Jeff Bezos on united_airlines website": 0.81
}