{
    "Who is your favorite artist?\n": [
        0.83,
        "Two of Serena’s favorite singers are Mariah Carey and Brandy.According toVenus and Serena Williams: A Biography.14."
    ],
    "What is your favorite warm weather activity?\n": [
        0.71,
        "The property flows almost seamlessly from indoor to outdoor, with an enclosed patio offering Serena and her guests space to relax when it starts to look a little overcast (or for her to chill on her own, as she's seen doing in anInstagrampost)."
    ],
    "What is your favorite musical instrument?\n": [
        0.93,
        "What is your favorite musical instrument?"
    ],
    "What color was the home you grew up in?\n": [
        0.75,
        "The kitchen continues the home's running aesthetic of clean neutral colors, with a white centerislandand chairs nestled against darker wooden furniture, shown in a photo on daughter Olympia'sInstagram."
    ],
    "What is your favorite type of music?\n": [
        0.8,
        "What is your favorite musical instrument?"
    ],
    "What is your favorite flavor of ice cream?\n": [
        0.97,
        "Favorite Ice Cream Flavor !!!!"
    ],
    "What is your favorite type of reading?\n": [
        0.77,
        "This board book distills tennis superstar Serena Williams’s excellent qualities into an eminently shareable read-aloud text with graphic, eye-catching illustrations.Each spread highlights an important trait, and is enhanced by a quote from Serena herself."
    ],
    "What was your favorite subject in school?\n": [
        1.0,
        "What was Serena Williams' favorite school subject?"
    ],
    "What was your favorite fruit or vegetable as a child?\n": [
        0.78,
        "But the health-conscious 23-time Grand Slam champion is not entirely alone in her desire for something nutritious,Pregnancy Magazinelists fruits and vegetables among some of the most common foods expectant mothers want to eat."
    ],
    "What musical instrument do you play?\n": [
        0.85,
        "I used to have an acoustic, which I played more."
    ],
    "What was your least favorite subject in school?\n": [
        1.0,
        "What was Serena Williams' favorite school subject?"
    ],
    "What is your favorite type of movie?\n": [
        0.71,
        "I got the heart of him.”Serena Williams, who executive produces the movie alongside sisters Venus Williams and Isha Price, says it was “an unbelievable experience” being on the set watching Smith play “such an intimate part of our lives.” She also promises “only true stories in this film, which really doesn't usually happen when it goes to Hollywood.”The Williams sisters shared many memories with the filmmakers, and here are some of the most interesting facts about “King Richard”:Holiday movie preview:10 new movies you can’t miss, from 'West Side Story' to new 'Spider-Man'Tennis wasn't Richard Williams' biggest priorityEarly on, the Williamses told filmmakers the movie needed to portray “how loving and kind their father was to them,” Smith says, and how different their perception of him was from the public’s."
    ],
    "What was your least favorite fruit or vegetable as a child?\n": [
        0.78,
        "But the health-conscious 23-time Grand Slam champion is not entirely alone in her desire for something nutritious,Pregnancy Magazinelists fruits and vegetables among some of the most common foods expectant mothers want to eat."
    ],
    "What is your favorite sport?\n": [
        0.77,
        "A Peek Inside Tennis Superstar Serena Williams' Luxurious Car Collectionwww.therichest.comThe Rich & PowerfulLuxury LifestyleLuxury ArchitectureMoreNet WorthTop ListsPrivacy PolicyFollow UsFollow TheRichest.comSomething NewNews on all your favorite celebs, reality TV, and movies.A fresh take on sports: the biggest news and most entertaining lists.The World's Most Entertaining Car WebsiteMoreWrite For UsHomeContact UsTermsPrivacyCopyrightAbout UsPress KitHomeLuxury LifestyleA Peek Inside Tennis Superstar Serena Williams' Luxurious Car CollectionA Peek Inside Tennis Superstar Serena Williams' Luxurious Car CollectionSerena Williams garage can undoubtedly make most gearheads envious.By Pratibha ChandelPublishedSep 10, 2022ShareShareTweetEmailCommentSince the early 1990s, Serena Williams has been one of the finest andrichest female tennis players in the world."
    ],
    "What was the make of your first car?": [
        0.87,
        "Safe to say Serena likes her cars, take a closer look at them here.Latest Automotive News:-Kendall Jenner's Car CollectionHere’s A Look At O. J. Simpson’s 2023 Car Car CollectionClassic Car Collection of Hollywood Legend James Cagney5."
    ],
    "Total Questions": 15,
    "Questions required for Password Reset": 1,
    "Combinations (nCr)": 15,
    "Vulnerability Score for Serena Williams on united_airlines website": 0.83
}