{
    "Who is your favorite artist?\n": [
        0.66,
        "However, do you know who Will Smith's favourite rapper of all time is?Will Smith triviaWill Smith's music has seen influences from many hip-hop artists over the course of his career, not to mention his collaborations with K-Ci, Billy Ocean, Dru Hill, Kool Moe Dee and others. However, did you know his favourite rapper of all time is Grandmaster Flash?"
    ],
    "What is your favorite warm weather activity?\n": [
        0.67,
        "The 1990 pilot of \"Fresh Prince\" centered on Smith's character having a fish-out-of-water experience as he left his hometown of West Philadelphia to live with his Uncle Phil (James Avery), Aunt Viv (Janet Hubert), and three cousins in their lavish Bel-Air mansion.The episode showed Will's lack of decorum, bold fashion sense, and constant use of slang like \"dope\" — all of which contrasted with the posh lifestyle of the Banks family."
    ],
    "What is your favorite musical instrument?\n": [
        0.78,
        "Will was in charge of playing drums, because he always loved music with the strong beat.Will Smith’s Artistic FamilyWill Smith grew up in a musical family, and he made sure that his kids do the same."
    ],
    "What color was the home you grew up in?\n": [
        0.73,
        "I started again making origami, flowers, more specifically, because it’s the season of rebirth and, we need to bring some colors ?"
    ],
    "What is your favorite type of music?\n": [
        0.74,
        "Will was in charge of playing drums, because he always loved music with the strong beat.Will Smith’s Artistic FamilyWill Smith grew up in a musical family, and he made sure that his kids do the same."
    ],
    "What is your favorite flavor of ice cream?\n": [
        0.76,
        "Leftovers make really yummy sandwiches with nut butter or cream cheese in between!Get the recipeApricotsPutting together a list of fruits wouldn’t be complete without apricots!"
    ],
    "What is your favorite type of reading?\n": [
        0.69,
        "Touch device users, explore by touch or with swipe gestures.Log inExploreEducationSaveFavorite SubjectMath is my least favorite subject.Abby Kline21followersMore informationMath is my least favorite subject.Favorite SubjectLeast FavoriteSubjectsMentalHumanMathMath ResourcesMathematicsMore information...More informationMath is my least favorite subject.CommentsNo comments yet!"
    ],
    "What was your favorite subject in school?\n": [
        0.83,
        "His favorite subject in school was math and he was actually quite good at it."
    ],
    "What was your favorite fruit or vegetable as a child?\n": [
        0.82,
        "It’s so easy to get into a rut of buying just apples, bananas, and oranges at the store, so this list of fruit for kids will give you new ideas.My goal is to both keep the kids interested in actually eating their fruit AND will help ensure that they’re getting a healthy range of nutrients throughout the week.Contentshide1List of Fruits for Kids2Healthy Fruit for Kids3Best Fruits for Toddlers4Apple5Apricots6Avocado7Banana8Blueberries9Cantaloupe10Cherries11Citrus12Cranberries13Figs14Grapes15Honeydew16Kiwi17Mango18Peaches19Pear20Pineapple21Plums22Pomegranate23Raspberries24Strawberries25Watermelon26Final Notes on this List of Fruits for KidsHealthy Fruit for KidsI always remind parents that kids who don’t love their veggies should be encouraged to enjoy fruit since they contain many of the same nutrients!"
    ],
    "What musical instrument do you play?\n": [
        0.81,
        "He used to be a hip-hop sensation before conquering Hollywood, but does he secretly have a flair for classical music, and enjoys playing the piano?Will Smith’s biographysuggests that he learnt how to play the piano in his youth, and he also mentionedhaving one at home."
    ],
    "What was your least favorite subject in school?\n": [
        0.83,
        "His favorite subject in school was math and he was actually quite good at it."
    ],
    "What is your favorite type of movie?\n": [
        0.71,
        "For different reasons, those are the two almost perfect movies."
    ],
    "What was your least favorite fruit or vegetable as a child?\n": [
        0.82,
        "It’s so easy to get into a rut of buying just apples, bananas, and oranges at the store, so this list of fruit for kids will give you new ideas.My goal is to both keep the kids interested in actually eating their fruit AND will help ensure that they’re getting a healthy range of nutrients throughout the week.Contentshide1List of Fruits for Kids2Healthy Fruit for Kids3Best Fruits for Toddlers4Apple5Apricots6Avocado7Banana8Blueberries9Cantaloupe10Cherries11Citrus12Cranberries13Figs14Grapes15Honeydew16Kiwi17Mango18Peaches19Pear20Pineapple21Plums22Pomegranate23Raspberries24Strawberries25Watermelon26Final Notes on this List of Fruits for KidsHealthy Fruit for KidsI always remind parents that kids who don’t love their veggies should be encouraged to enjoy fruit since they contain many of the same nutrients!"
    ],
    "What is your favorite sport?\n": [
        0.65,
        "At one point he was in early talks to developA Star Is Bornremake alongside Jennifer Lopez, and it’s highly likely he would’ve had to step up his game and learn to play an instrument for this project, but they never got it off the ground.What Was Will Smith’s SAT Score?What Cologne Does Will Smith Wear?Where Did Will Smith Grow Up?Will Smith’s Musical BackgroundSeveral of Will Smith’s biographies suggest that he learnt to play the piano in his youth."
    ],
    "What was the make of your first car?": [
        0.81,
        "The Azure is an ultra-exclusive luxury convertible car, and it is also one of the oldest cars in Will Smith’s car collection, as the model he has is from 1998."
    ],
    "Total Questions": 15,
    "Questions required for Password Reset": 1,
    "Combinations (nCr)": 15,
    "Vulnerability Score for Will Smith on united_airlines website": 0.75
}