{
    "Who is your favorite artist?\n": [
        0.71,
        "Favourite Music Recommended by Elon Musk Full ListFEEDCELEBRITIESENRUUAESSign InSign UpCelebritiesElon MuskMusicElon MuskEntrepreneur Scientist elon musk fans.page965Followers170FLIISTsFollowFan PageThis page is not official or personal."
    ],
    "What is your favorite warm weather activity?\n": [
        0.73,
        "It s hard to pick a favorite though we re partial to the nectarine and plum conserve chewy thick and rich with sunny fruit flavor."
    ],
    "What is your favorite musical instrument?\n": [
        0.8,
        "Favourite Music Recommended by Elon Musk Full ListFEEDCELEBRITIESENRUUAESSign InSign UpCelebritiesElon MuskMusicElon MuskEntrepreneur Scientist elon musk fans.page965Followers170FLIISTsFollowFan PageThis page is not official or personal."
    ],
    "What color was the home you grew up in?\n": [
        0.71,
        "The home is within walking distance of the facility where SpaceX is working on building a giant rocket Musk added."
    ],
    "What is your favorite type of music?\n": [
        0.77,
        "Favourite Music Recommended by Elon Musk Full ListFEEDCELEBRITIESENRUUAESSign InSign UpCelebritiesElon MuskMusicElon MuskEntrepreneur Scientist elon musk fans.page965Followers170FLIISTsFollowFan PageThis page is not official or personal."
    ],
    "What is your favorite flavor of ice cream?\n": [
        0.8,
        "Thanks to Elon Musk Blue Bell ice cream really is out of this world RareMenuFollow usFacebookTwitterInstagramPinterestSearchSearch for SearchNewsEntertainmentPoliticsTrendingStoreJobsMenuSearchSearch for SearchYou are here HomeRare HoustonThanks to Elon Musk Blue Bell ice cream really is out of this worldThanks to Elon Musk Blue Bell ice cream really is out of this worldFILE In this April 10 2015 file photo Blue Bell ice cream rests on a grocery store shelf in Lawrence Kan. Blue Bell Creameries will lay off more than a third of its workforce following a series of listeria illnesses linked to its ice cream that prompted a nationwide recall the Texas company announced Friday May 15 12015."
    ],
    "What is your favorite type of reading?\n": [
        0.74,
        "Favourite Music Recommended by Elon Musk Full ListFEEDCELEBRITIESENRUUAESSign InSign UpCelebritiesElon MuskMusicElon MuskEntrepreneur Scientist elon musk fans.page965Followers170FLIISTsFollowFan PageThis page is not official or personal."
    ],
    "What was your favorite subject in school?\n": [
        0.78,
        "CNBC on Instagram Young Elon Musk had two favorite subjects in high school physics and computer science."
    ],
    "What was your favorite fruit or vegetable as a child?\n": [
        0.83,
        "Fresh Fruits and Vegetables Fresh Fruits Vegetables Note on Pack House."
    ],
    "What musical instrument do you play?\n": [
        0.74,
        "He was master at Dungeons DragonsAlong with his cousins Musk loved playing the fantasy role playing game."
    ],
    "What was your least favorite subject in school?\n": [
        0.78,
        "CNBC on Instagram Young Elon Musk had two favorite subjects in high school physics and computer science."
    ],
    "What is your favorite type of movie?\n": [
        0.72,
        "World Billionaire Elon Musk Names Black Sherif As His Favorite Artist And Wants To See Him One Day video AnythingGhSkip to ContentAnythingGhGhana s Best Entertainment and Information HubHOMEMUSICGOSSIPSSPORTSMUSIC VIDEOSCURRENT AFFAIRSCULTURE TOURISMSOCIAL MEDIA TRENDSLoans Types Of Loans In Fidelity Bank GhanaLooking for Something HomeGOSSIPSWorld Billionaire Elon Musk Names Black Sherif As His Favorite Artist And Wants To See Him One Day video GOSSIPSWorld Billionaire Elon Musk Names Black Sherif As His Favorite Artist And Wants To See Him One Day video Anything GH StaffOctober 6 2022October 6 2022One of the richest men in the world Elon Musk has named hip pop act Black Sherif as his favorite musician right now.He said he could relate to his songs and listens to him often hence being his favorite."
    ],
    "What was your least favorite fruit or vegetable as a child?\n": [
        0.83,
        "Fresh Fruits and Vegetables Fresh Fruits Vegetables Note on Pack House."
    ],
    "What is your favorite sport?\n": [
        0.69,
        "Favourite Music Recommended by Elon Musk Full ListFEEDCELEBRITIESENRUUAESSign InSign UpCelebritiesElon MuskMusicElon MuskEntrepreneur Scientist elon musk fans.page965Followers170FLIISTsFollowFan PageThis page is not official or personal."
    ],
    "What was the make of your first car?": [
        0.81,
        "Please put invented car fart on my gravestone Musk tweeted."
    ],
    "Total Questions": 15,
    "Questions required for Password Reset": 1,
    "Combinations (nCr)": 15,
    "Vulnerability Score for Elon Musk on united_airlines website": 0.76
}