{
    "Who is your favorite artist?\n": [
        0.67,
        "Does Barack Obama's Favorite Music Make Him More Interesting?ServicesBIGG SolutionsJoin Our CommunityFollow Our PodcastAboutContactMenuMenuBlogDoes Barack Obama’s Favorite Music Make Him More Interesting?June 27, 2008/inProfessional Development/byGeorge Krueger & Mary-Lynn FosterRolling Stone interviewed Barack Obama recently."
    ],
    "What is your favorite warm weather activity?\n": [
        0.81,
        "Inauguration day temperature: Can Obama keep warmer weather pledge?"
    ],
    "What is your favorite musical instrument?\n": [
        0.85,
        "Does Barack Obama play a musical instrument?"
    ],
    "What color was the home you grew up in?\n": [
        0.78,
        "Michelle has shared small glimpses inside her family home on social media by posting throwback photos from her childhood.READ:Michelle Obama reveals very surprising items she took from The White HouseMORE:Serena Williams has overhauled Miami home - and there's no tennis courtThe former First Lady grew up in ChicagoOne shows a young Michelle standing on a brown sofa next to her parents in their living room."
    ],
    "What is your favorite type of music?\n": [
        0.77,
        "Last week theNew York Timespublished anop-edtitled “In Praise of Barack Obama, Music Critic.”This year Obama seemed to signal his attunement to the diffuse state of popular music, where genre-agnosticism is often a virtue, by noting that his picks ranged “from hip-hop to country to The Boss.” He included American breakoutsLizzoandDaBaby,Nigerian artistsBurna BoyandRema,andRosalíaandJ Balvin’s\"Con Altura,\" although he omitted Balvin’s credit on the song."
    ],
    "What is your favorite flavor of ice cream?\n": [
        0.96,
        "What is Barack Obama's favorite ice cream?"
    ],
    "What is your favorite type of reading?\n": [
        0.73,
        "First, it’s exciting to see which books you’ve read that a former president has read too, and second, he always offers an array of diverse reads, so you know you’re also bound to find something new and impactful to read next,” Buonocore said.Obama shopping at Politics and Prose, an independent bookseller in Washington, D.C.JIM WATSON//Getty ImagesAlthough the lists are generally well received among anyone not naturally inclined to hate Barack Obama for unrelated political reasons, not everyone believes the authenticity of his recommendations."
    ],
    "What was your favorite subject in school?\n": [
        1.0,
        "What was Barack Obama's favorite subject in school?"
    ],
    "What was your favorite fruit or vegetable as a child?\n": [
        0.8,
        "His typical order would be shaved ice topped with melon, cherry, or lime syrup.Trump’s Favorite Simple Pleasure: Bacon and EggsFlickrTrump is not a breakfast guy, but when he does indulge in themost important meal of the day, he opts for a simple plate of bacon andwell-done eggs.Obama’s Favorite Vegetable: Broccolishomova / iStockIn 2013, Obama told a group of student journalists that his overall favorite food (and, therefore, also his favorite vegetable) was broccoli."
    ],
    "What musical instrument do you play?\n": [
        1.0,
        "Does Barack Obama play a musical instrument?"
    ],
    "What was your least favorite subject in school?\n": [
        1.0,
        "What was Barack Obama's favorite subject in school?"
    ],
    "What is your favorite type of movie?\n": [
        0.74,
        "I always look forward to sharing my lists of favorite books, movies, and music with all of you,\" he wrote.Here's the complete list Obama's picks this year:Barack Obama's favorite movies of 2022\"The Fabelmans\"\"Decision to Leave\"\"The Woman King\"\"Aftersun\"\"Emily the Criminal\"\"Petite Maman\"\"Descendant\"\"Happening\"\"Till\"\"Everything Everywhere All at Once\"\"Top Gun: Maverick\"\"The Good Boss\"\"Wheel of Fortune and Fantasy\"\"A Hero\"\"Hit the Road\"\"Tár\"\"After Yang\"Barack Obama's favorite songs of 2022\"The Heart Part 5\" by Kendrick Lamar\"Tití Me Preguntó\" by Bad Bunny\"POF\" by Ari Lennox\"Something in the Orange\" by Zach Bryan\"Last Last\" by Burna Boy\"American Teenager\" by Ethel Cain\"Communion in My Cup\" by Tank And The Bangas ft."
    ],
    "What was your least favorite fruit or vegetable as a child?\n": [
        0.8,
        "His typical order would be shaved ice topped with melon, cherry, or lime syrup.Trump’s Favorite Simple Pleasure: Bacon and EggsFlickrTrump is not a breakfast guy, but when he does indulge in themost important meal of the day, he opts for a simple plate of bacon andwell-done eggs.Obama’s Favorite Vegetable: Broccolishomova / iStockIn 2013, Obama told a group of student journalists that his overall favorite food (and, therefore, also his favorite vegetable) was broccoli."
    ],
    "What is your favorite sport?\n": [
        0.75,
        "Which sports teams does Barack Obama cheer for?"
    ],
    "What was the make of your first car?": [
        0.73,
        "After they waited for the car to start, Barack then warned her to avoid the \"rusted-out, four-inch hole\" in the car's floor."
    ],
    "Total Questions": 15,
    "Questions required for Password Reset": 1,
    "Combinations (nCr)": 15,
    "Vulnerability Score for Barack Obama on united_airlines website": 0.83
}