{
    "In what city were you born?\n": [
        0.63,
        "Venus Williams,Peoplemagazine, June 28, 2004.From diapers to tennis skirtsThe youngest of five daughters born to Richard and Oracene (who goes by the nickname Brandy), Serena and the rest of the Williams family moved from her birthplace of Saginaw, Michigan, to Compton, a suburb ofLos Angeles,California, when she was a baby."
    ],
    "What is the name of your pet?\n": [
        0.68,
        "Is Serena Williams' Dog Named After Rafael Nadal?"
    ],
    "What is your favorite food to eat?\n": [
        0.86,
        "Keep on reading.She rarely eats breakfastShutterstockAs part of her initiative to eat healthier, Serena Williams said she's \"trying to eat a clean diet of natural, raw foods.\""
    ],
    "What is your favorite holiday?\n": [
        0.73,
        "Serena Williams enjoys Yucatan’s wonder and gastronomyCELEBRITIESCelebrity CouplesCelebrity MomsCelebrity KidsCelebrity ParentsCelebrity HomesENTERTAINMENTMusicMoviesNetflixROYALSKate MiddletonMeghan MarklePrince HarryQueen LetiziaQueen MaximaCharlotte CasiraghiSpanish RoyalsBritish RoyalsMonaco RoyalsBEAUTYSkincareMakeupNailsHairCelebrity BeautyFASHIONCelebrity StyleRoyal StyleFashion TrendsStreet StyleRed CarpetRunwayLIFESTYLEHealth and WellnessFitness and workoutLeisure and TravelWeddingsFOODRecipesHealthy FoodLatin CookingDrinks and CocktailsAMÉRICASCELEBRIDADESENTRETENIMIENTOREALEZABELLEZAMODALIFESTYLELATINA POWERHOUSEFOTOSHOLA+LATINA POWERHOUSEPHOTOSH!/CELEBRITIESUS EditionUS EditionMX EditionES EditionHomeCelebritiesEntertainmentRoyalsHealth and BeautyFashionLifeStyleFoodAméricasCELEBRITIESENTRETENIMIENTOREALEZAMODABELLEZALIFESTYLELATINA POWERHOUSEFOTOSHOLA+Latina PowerhousePHOTOSContact HOLA!"
    ],
    "What is your favorite movie?\n": [
        0.73,
        "Williams Pulling Off a ‘Tom Brady’ on Jimmy Fallon’s Show7 months agoPreviously, we have seen Olympia singing a song from the Disney movie‘Encanto’.Moreover, she often builds Legos of famous Disney movies or characters as well."
    ],
    "What is your favorite sport?\n": [
        0.78,
        "RetrievedSeptember 24,2019.^\"Serena Williams picked as greatest female player of the Open Era by BBC Sport users\".BBC Sport."
    ],
    "What is your mother’s maiden name?": [
        0.85,
        "Is Richard Williams Still Married to Serena Williams' Mother?"
    ],
    "Total Questions": 7,
    "Questions required for Password Reset": 1,
    "Combinations (nCr)": 7,
    "Vulnerability Score for Serena Williams on usps website": 0.75
}