{
    "In what city were you born?\n": [
        0.63,
        "While he has spoken over the years about how much he loves the city and how much he wants to give back, none of his proposed ventures in the city of Philadelphia have ever been developed."
    ],
    "What is the name of your pet?\n": [
        0.69,
        "The 14th NY Pet Fashion Show is Much More Adorable and AmazingBarbra Streisand cloned her dog, spending up to $500,000Hero Accountant Runs a Pet  and Dog Retirement Home for \"Unadoptables\"Gunther VI, World's Richest Dog, Buys Nicolas Cage's Private Island in the BahamasCelebrity PetsRelatedAlica Schmidt PetsBrandon Frazier PetsHulk Hogan PetsAndy Serkis PetsDavid Attenborough PetsJacob Tremblay PetsKarl Urban PetsHannah Kepple PetsZoe Chao PetsJeffrey Dean Morgan PetsHayley Williams PetsZiggy Marley PetsMenuHomeArticlesFeature My PetTerms Of UseAbout UsContact UsDMCAPrivacy PolicyPopular TagsActorsMusiciansAthletesCreatorsComediansDogsCatsBirdsCrittersHorsesTop© 2023 Celebrity Pets / All Rights Reserved."
    ],
    "What is your favorite food to eat?\n": [
        0.84,
        "food is the Philly cheese steak but his favorite dessert is not"
    ],
    "What is your favorite holiday?\n": [
        0.7,
        "What's Your Favorite Will Smith Movie?"
    ],
    "What is your favorite movie?\n": [
        1.0,
        "What's Your Favorite Will Smith Movie?"
    ],
    "What is your favorite sport?\n": [
        0.78,
        "Will Smith Favorite Color Food Music Sports Football Team Hobbies BiographySearch by category:AthletesBody MeasurementsActorsActressesAthletesMedia PersonalityModelsMusiciansPublic FigureSocial Media StarEventsFamily TreeFashionFilm & TVActorsActressesMusicNet WorthNewsPoliticsAbout UsPrivacy PolicyCookie PolicyHomeCeleb Favorite ThingsActorsActressesSingersModelsAthletesPoliticiansCeleb Family TreeBody MeasurementsActorsActressesModelsAthletesMusiciansPublic FigureSocial Media StarMedia PersonalityActorsHome»Film & TV»Actors»Will Smith Favorite Color Food Music Sports Football Team Hobbies BiographyWill Smith Favorite Color Food Music Sports Football Team Hobbies BiographyThe American actor and rapper, Willard Carroll Smith, Jr. was born on September 25, 1968 to Philadelphia school board administrator Caroline Bright and refrigeration engineer, Willard Carroll Smith, Sr. At the age of 16, Will Smith along with his childhood friend, Jeffrey Townes, for a rapping duo DJ Jazzy Jeff & The Fresh Prince."
    ],
    "What is your mother’s maiden name?": [
        0.93,
        "What's your mother's maiden name?"
    ],
    "Total Questions": 7,
    "Questions required for Password Reset": 2,
    "Combinations (nCr)": 21,
    "Vulnerability Score for Will Smith on usps website": 0.8
}