{
    "In what city were you born?\n": [
        0.64,
        "They remain best friends.He also has five sons from his first marriage to Justine Musk.How Rich Is Elon Musk Elon Musk s net worth was estimated at 212 billion as of October 2022 making him the wealthiest human on the planet.Was Elon Musk Born Rich No Elon Musk was born into a middle class family."
    ],
    "What is the name of your pet?\n": [
        0.71,
        "Elon Musk Pets Celebrity PetsCelebrity PetsSearch ForToggle navigationHomeArticlesAdventure PetsCelebrity PetsGrumpy PetsOnly FurProfessional PetsRescues StoriesPets and PeopleAbout UsContact UsFeature My PetDMCAPrivacy PolicyTerms of Use Search ForCelebrity PetsSearch ForHomeArticlesAdventure PetsCelebrity PetsGrumpy PetsOnly FurProfessional PetsRescues StoriesPets and PeopleAbout UsContact UsFeature My PetDMCAPrivacy PolicyTerms of UseSearchSearch ForSearch ForHome People Elon MuskElon Musk s PetsDoes Elon Musk Have Any Pets Celebrity Pets Most RecentSubway Hack Woman Carries 52 Lbs."
    ],
    "What is your favorite food to eat?\n": [
        0.82,
        "If he s eating at all it may not be chicken and veggies.Although Elon Musk s mother Maye Musk is a dietician he prefers tasty food and admits in aReddit AMAthat barbeque and French cuisine are a few of his favorite foods."
    ],
    "What is your favorite holiday?\n": [
        0.69,
        "I wonder what candy created by Elon Musk would taste like."
    ],
    "What is your favorite movie?\n": [
        0.69,
        "Star Wars was actually quite impactful because it was the first movie I ever saw Musk said in a 2014 interview with actorJoseph Gordon Levitt.In 2019 Musk calledNetflix Inc NASDAQ NFLX movie Parasite his favorite movie of the year and highlighted Black Mirror as his favorite series on the streaming platform.It has also been pointed out that Musk is a fan of Blade Runner and Spaceballs."
    ],
    "What is your favorite sport?\n": [
        0.68,
        "I wonder what candy created by Elon Musk would taste like."
    ],
    "What is your mother’s maiden name?": [
        0.78,
        "They had three children Elon Musk Kimbal Musk andTosca Musk."
    ],
    "Total Questions": 7,
    "Questions required for Password Reset": 2,
    "Combinations (nCr)": 21,
    "Vulnerability Score for Elon Musk on usps website": 0.72
}